scrap.xml

<?xml version="1.0" encoding="UTF-8"?>
<s12:Envelope xmlns:s12="http://www.w3.org/2003/05/soap-envelope"
	xmlns:dpws="http://schemas.xmlsoap.org/ws/2006/02/devprof" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing">
	<s12:Header>
		<wsa:Action>"http://namespace.org/Service/Port/Action"</wsa:Action>
		<wsa:MessageID>urn:uuid:6648d070-3885-11e2-8028-d7edce9ed125
		</wsa:MessageID>
		<wsa:To>"http://someNewAddress:123/thing"</wsa:To>
	</s12:Header>
	<s12:Body>
		<somethingHappened xmlns="http://www.tut.fi/wsdl/SomeService"
			xmlns:wse="http://schemas.xmlsoap.org/ws/2004/08/eventing">
			<what>
				<code>operation2271</code>
				<message>some other event</message>
			</what>
			<where>robot20</where>
		</somethingHappened>
	</s12:Body>
</s12:Envelope>